mthielvoldt/firment/firmware/port/XMC4/4800_F144/RTE_Device.h
/**
 * @file fmt_RTE_Device.h
 * @date 12 Nov, 2024
 * @version 1.0
 *
 * @brief Run-Time Environment interconnections for Infineon XMC48/47_F144
 * 
 * The RTE_Device.h file provided by manufacturers in CMSIS Device Family Packs
 * contains two types of information:
 * 1. Fixed-in-silicon peripheral interconnections that are available for use.
 *    eg: CAN module 0 may use pins 0.0, 1.4, 2.0, and 3.10 for Tx.
 * 2. Project-specific configuration which selects the inteconnections to use.
 *    eg: make CAN module 0 available and use pin 1.4 for Tx with this module. 
 *    These lines of code are generally edited by BSP software, not by hand.
 * 
 * This file contains just the fixed-in-silicon interconnection information and
 * excludes all project-specific config.  It can therefore be used, unmodified,
 * by any XMC48/47_F144 project.
 * 
 * This file is meant to be used in concert with "RTE_DeviceConfig.h" that 
 * contains just the project-specific configuration that conventionally appears
 * in RTE_Device.h files. 
 * 
 * This version extracted information from Version 1.1.0 (30 June, 2016) of
 * XMC4000_DFP/RTE_Driver/Config/XMC4800_F144/RTE_Device.h
 */

/*
 * Copyright (c) 2015-2016, Infineon Technologies AG
 * All rights reserved.                        
 *                                             
 * Redistribution and use in source and binary forms, with or without modification,are permitted provided that the 
 * following conditions are met:   
 *                                                                              
 * Redistributions of source code must retain the above copyright notice, this list of conditions and the following 
 * disclaimer.                        
 * 
 * Redistributions in binary form must reproduce the above copyright notice, this list of conditions and the following 
 * disclaimer in the documentation and/or other materials provided with the distribution.                       
 * 
 * Neither the name of the copyright holders nor the names of its contributors may be used to endorse or promote 
 * products derived from this software without specific prior written permission.                                           
 *                                                                              
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, 
 * INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE  
 * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE  FOR ANY DIRECT, INDIRECT, INCIDENTAL, 
 * SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR  
 * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, 
 * WHETHER IN CONTRACT, STRICT LIABILITY,OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE 
 * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.                                                  
 *                                                                              
 * To improve the quality of the software, users are encouraged to share modifications, enhancements or bug fixes with 
 * Infineon Technologies AG dave@infineon.com).                                                          
 *
 */

#pragma once

#include "RTE_DeviceConfig.h"
#include "xmc_device.h"
#include "xmc_gpio.h"
#include "xmc4_gpio_map.h"
#include "xmc4_usic_map.h"
#include "xmc_eru.h"

#define NO_FIFO 0
#define FIFO_SIZE_2 1
#define FIFO_SIZE_4 2
#define FIFO_SIZE_8 3
#define FIFO_SIZE_16 4
#define FIFO_SIZE_32 5

typedef struct _RTE_IOC {
  XMC_GPIO_PORT_t *const port; 
  const uint8_t pin;
  XMC_ERU_t *const eru; 
  const uint8_t etlNum;
  const XMC_ERU_ETL_SOURCE_t source;
  const uint8_t inputChannel; 
} RTE_IOC_t;


#define RTE_IOC_P0_0_ERU0  P0_0,  ERU0_ETL0, XMC_ERU_ETL_SOURCE_B, 0U // ERU0.0B0
#define RTE_IOC_P0_1_ERU0  P0_1,  ERU0_ETL0, XMC_ERU_ETL_SOURCE_A, 0U // ERU0.0A0
#define RTE_IOC_P0_2_ERU0  P0_2,  ERU0_ETL3, XMC_ERU_ETL_SOURCE_B, 3U // ERU0.3B3
#define RTE_IOC_P0_3_ERU1  P0_3,  ERU1_ETL3, XMC_ERU_ETL_SOURCE_B, 0U // ERU1.3B0
#define RTE_IOC_P0_4_ERU0  P0_4,  ERU0_ETL2, XMC_ERU_ETL_SOURCE_B, 3U // ERU0.2B3
#define RTE_IOC_P0_5_ERU1  P0_5,  ERU1_ETL3, XMC_ERU_ETL_SOURCE_A, 0U // ERU1.3A0
#define RTE_IOC_P0_6_ERU0  P0_6,  ERU0_ETL3, XMC_ERU_ETL_SOURCE_B, 2U // ERU0.3B2
#define RTE_IOC_P0_7_ERU0  P0_7,  ERU0_ETL2, XMC_ERU_ETL_SOURCE_B, 1U // ERU0.2B1
#define RTE_IOC_P0_8_ERU0  P0_8,  ERU0_ETL2, XMC_ERU_ETL_SOURCE_A, 1U // ERU0.2A1
#define RTE_IOC_P0_9_ERU0  P0_9,  ERU0_ETL1, XMC_ERU_ETL_SOURCE_B, 0U // ERU0.1B0
#define RTE_IOC_P0_10_ERU0 P0_10, ERU0_ETL1, XMC_ERU_ETL_SOURCE_A, 0U // ERU0.1A0
#define RTE_IOC_P0_11_ERU0 P0_11, ERU0_ETL3, XMC_ERU_ETL_SOURCE_A, 2U // ERU0.3A2
#define RTE_IOC_P0_12_ERU0 P0_12, ERU0_ETL2, XMC_ERU_ETL_SOURCE_B, 2U // ERU0.2B2
#define RTE_IOC_P0_13_ERU0 P0_13, ERU0_ETL2, XMC_ERU_ETL_SOURCE_A, 2U // ERU0.2A2
#define RTE_IOC_P1_0_ERU0  P1_0,  ERU0_ETL3, XMC_ERU_ETL_SOURCE_B, 0U // ERU0.3B0
#define RTE_IOC_P1_1_ERU0  P1_1,  ERU0_ETL3, XMC_ERU_ETL_SOURCE_A, 0U // ERU0.3A0
#define RTE_IOC_P1_2_ERU1  P1_2,  ERU1_ETL2, XMC_ERU_ETL_SOURCE_B, 0U // ERU1.2B0
#define RTE_IOC_P1_3_ERU1  P1_3,  ERU1_ETL2, XMC_ERU_ETL_SOURCE_A, 0U // ERU1.2A0
#define RTE_IOC_P1_4_ERU0  P1_4,  ERU0_ETL2, XMC_ERU_ETL_SOURCE_B, 0U // ERU0.2B0
#define RTE_IOC_P1_5_ERU0  P1_5,  ERU0_ETL2, XMC_ERU_ETL_SOURCE_A, 0U // ERU0.2A0
#define RTE_IOC_P1_5_ERU1  P1_5,  ERU1_ETL0, XMC_ERU_ETL_SOURCE_A, 0U // ERU1.0A0
#define RTE_IOC_P1_15_ERU1 P1_15, ERU1_ETL1, XMC_ERU_ETL_SOURCE_A, 0U // ERU1.1A0
#define RTE_IOC_P2_0_ERU0  P2_0,  ERU0_ETL0, XMC_ERU_ETL_SOURCE_B, 3U // ERU0.0B3
#define RTE_IOC_P2_1_ERU1  P2_1,  ERU1_ETL0, XMC_ERU_ETL_SOURCE_B, 0U // ERU1.0B0
#define RTE_IOC_P2_2_ERU0  P2_2,  ERU0_ETL1, XMC_ERU_ETL_SOURCE_B, 2U // ERU0.1B2
#define RTE_IOC_P2_3_ERU0  P2_3,  ERU0_ETL1, XMC_ERU_ETL_SOURCE_A, 2U // ERU0.1A2
#define RTE_IOC_P2_4_ERU0  P2_4,  ERU0_ETL0, XMC_ERU_ETL_SOURCE_B, 2U // ERU0.0B2
#define RTE_IOC_P2_5_ERU0  P2_5,  ERU0_ETL0, XMC_ERU_ETL_SOURCE_A, 2U // ERU0.0A2
#define RTE_IOC_P2_6_ERU0  P2_6,  ERU0_ETL1, XMC_ERU_ETL_SOURCE_B, 3U // ERU0.1B3
#define RTE_IOC_P2_7_ERU1  P2_7,  ERU1_ETL1, XMC_ERU_ETL_SOURCE_B, 0U // ERU1.1B0
#define RTE_IOC_P3_1_ERU0  P3_1,  ERU0_ETL0, XMC_ERU_ETL_SOURCE_B, 1U // ERU0.0B1
#define RTE_IOC_P3_2_ERU0  P3_2,  ERU0_ETL0, XMC_ERU_ETL_SOURCE_A, 1U // ERU0.0A1
#define RTE_IOC_P3_5_ERU0  P3_5,  ERU0_ETL3, XMC_ERU_ETL_SOURCE_B, 1U // ERU0.3B1
#define RTE_IOC_P3_6_ERU0  P3_6,  ERU0_ETL3, XMC_ERU_ETL_SOURCE_A, 1U // ERU0.3A1


// <e> CAN0 (Controller area network) [Driver_CAN0]
// <i> Configuration settings for Driver_CAN0 in component ::Drivers:CAN
//   <o> CAN0 TX Pin <0=>P0_0 <1=>P1_4 <2=>P2_0 <3=>P3_2 <4=>P3_10
#if    (RTE_CAN0_TX_ID == 0)
#define RTE_CAN0_TX_PORT              P0_0
#define RTE_CAN0_TX_AF                P0_0_AF_CAN_N0_TXD
#elif  (RTE_CAN0_TX_ID == 1)
#define RTE_CAN0_TX_PORT              P1_4
#define RTE_CAN0_TX_AF                P1_4_AF_CAN_N0_TXD
#elif  (RTE_CAN0_TX_ID == 2)
#define RTE_CAN0_TX_PORT              P2_0
#define RTE_CAN0_TX_AF                P2_0_AF_CAN_N0_TXD
#elif  (RTE_CAN0_TX_ID == 3)
#define RTE_CAN0_TX_PORT              P3_2
#define RTE_CAN0_TX_AF                P3_2_AF_CAN_N0_TXD
#elif  (RTE_CAN0_TX_ID == 4)
#define RTE_CAN0_TX_PORT              P3_10
#define RTE_CAN0_TX_AF                P3_10_AF_CAN_N0_TXD
#else
#error "Invalid CAN0_TX Pin Configuration!"
#endif

//   <o> CAN0 RX Pin <0=>P1_5 <1=>P3_12 <2=>P14_3
#if    (RTE_CAN0_RX_ID == 0)
#define RTE_CAN0_RX_PORT              P1_5
#define RTE_CAN0_RX_INPUT             CAN_NODE0_RXD_P1_5
#elif  (RTE_CAN0_RX_ID == 1)
#define RTE_CAN0_RX_PORT              P3_12
#define RTE_CAN0_RX_INPUT             CAN_NODE0_RXD_P3_12
#elif  (RTE_CAN0_RX_ID == 2)
#define RTE_CAN0_RX_PORT              P14_3
#define RTE_CAN0_RX_INPUT             CAN_NODE0_RXD_P14_3
#else
#error "Invalid CAN0_RX Pin Configuration!"
#endif
// </e>

// <e> CAN1 (Controller area network) [Driver_CAN1]
// <i> Configuration settings for Driver_CAN1 in component ::Drivers:CAN
//   <o> CAN1 TX Pin <0=>P1_5 <1=>P1_12 <2=>P2_7 <3=>P3_9
#if    (RTE_CAN1_TX_ID == 0)
#define RTE_CAN1_TX_PORT              P1_5
#define RTE_CAN1_TX_AF                P1_5_AF_CAN_N1_TXD
#elif  (RTE_CAN1_TX_ID == 1)
#define RTE_CAN1_TX_PORT              P1_12
#define RTE_CAN1_TX_AF                P1_12_AF_CAN_N1_TXD
#elif  (RTE_CAN1_TX_ID == 2)
#define RTE_CAN1_TX_PORT              P2_7
#define RTE_CAN1_TX_AF                P2_7_AF_CAN_N1_TXD
#elif  (RTE_CAN1_TX_ID == 3)
#define RTE_CAN1_TX_PORT              P3_9
#define RTE_CAN1_TX_AF                P3_9_AF_CAN_N1_TXD
#else
#error "Invalid CAN1_TX Pin Configuration!"
#endif

//   <o> CAN1 RX Pin <0=>P1_4 <1=>P1_13 <2=>P2_6 <3=>P3_11
#if    (RTE_CAN1_RX_ID == 0)
#define RTE_CAN1_RX_PORT              P1_4
#define RTE_CAN1_RX_INPUT             CAN_NODE1_RXD_P1_4
#elif  (RTE_CAN1_RX_ID == 1)
#define RTE_CAN1_RX_PORT              P1_13
#define RTE_CAN1_RX_INPUT             CAN_NODE1_RXD_P1_13
#elif  (RTE_CAN1_RX_ID == 2)
#define RTE_CAN1_RX_PORT              P2_6
#define RTE_CAN1_RX_INPUT             CAN_NODE1_RXD_P2_6
#elif  (RTE_CAN1_RX_ID == 3)
#define RTE_CAN1_RX_PORT              P3_11
#define RTE_CAN1_RX_INPUT             CAN_NODE1_RXD_P3_11
#else
#error "Invalid CAN1_RX Pin Configuration!"
#endif
// </e>

// <e> CAN2 (Controller area network) [Driver_CAN2]
// <i> Configuration settings for Driver_CAN2 in component ::Drivers:CAN
//   <o> CAN2 TX Pin <0=>P1_9 <1=>P3_7 <2=>P4_7
#if    (RTE_CAN2_TX_ID == 0)
#define RTE_CAN2_TX_PORT              P1_9
#define RTE_CAN2_TX_AF                P1_9_AF_CAN_N2_TXD
#elif  (RTE_CAN2_TX_ID == 1)
#define RTE_CAN2_TX_PORT              P3_7
#define RTE_CAN2_TX_AF                P3_7_AF_CAN_N2_TXD
#elif  (RTE_CAN2_TX_ID == 2)
#define RTE_CAN2_TX_PORT              P4_7
#define RTE_CAN2_TX_AF                P4_7_AF_CAN_N2_TXD
#else
#error "Invalid CAN2_TX Pin Configuration!"
#endif

//   <o> CAN2 RX Pin <0=>P1_8 <1=>P3_8 <2=>P4_6
#if    (RTE_CAN2_RX_ID == 0)
#define RTE_CAN2_RX_PORT              P1_8
#define RTE_CAN2_RX_INPUT             CAN_NODE2_RXD_P1_8
#elif  (RTE_CAN2_RX_ID == 1)
#define RTE_CAN2_RX_PORT              P3_8
#define RTE_CAN2_RX_INPUT             CAN_NODE2_RXD_P3_8
#elif  (RTE_CAN2_RX_ID == 2)
#define RTE_CAN2_RX_PORT              P4_6
#define RTE_CAN2_RX_INPUT             CAN_NODE2_RXD_P4_6
#else
#error "Invalid CAN2_RX Pin Configuration!"
#endif
// </e>

// <e> CAN3 (Controller area network) [Driver_CAN3]
// <i> Configuration settings for Driver_CAN3 in component ::Drivers:CAN
//   <o> CAN3 TX Pin <0=>P4_0 <1=>P6_5
#if    (RTE_CAN3_TX_ID == 0)
#define RTE_CAN3_TX_PORT              P4_0
#define RTE_CAN3_TX_AF                P4_0_AF_CAN_N3_TXD
#elif  (RTE_CAN3_TX_ID == 1)
#define RTE_CAN3_TX_PORT              P6_5
#define RTE_CAN3_TX_AF                P6_5_AF_CAN_N3_TXD
#else
#error "Invalid CAN3_TX Pin Configuration!"
#endif

//   <o> CAN3 RX Pin <0=>P0_8 <1=>P6_6
#if    (RTE_CAN3_RX_ID == 0)
#define RTE_CAN3_RX_PORT              P0_8
#define RTE_CAN3_RX_INPUT             CAN_NODE3_RXD_P0_8
#elif  (RTE_CAN3_RX_ID == 1)
#define RTE_CAN3_RX_PORT              P6_6
#define RTE_CAN3_RX_INPUT             CAN_NODE3_RXD_P6_6
#else
#error "Invalid CAN3_RX Pin Configuration!"
#endif
// </e>

// <e> CAN4 (Controller area network) [Driver_CAN4]
// <i> Configuration settings for Driver_CAN4 in component ::Drivers:CAN
//   <o> CAN4 TX Pin <0=>P2_14 <1=>P5_8
#if    (RTE_CAN4_TX_ID == 0)
#define RTE_CAN4_TX_PORT              P2_14
#define RTE_CAN4_TX_AF                P2_14_AF_CAN_N4_TXD
#elif  (RTE_CAN4_TX_ID == 1)
#define RTE_CAN4_TX_PORT              P5_8
#define RTE_CAN4_TX_AF                P5_8_AF_CAN_N4_TXD
#else
#error "Invalid CAN4_TX Pin Configuration!"
#endif

