mthielvoldt/firment/firmware/port/XMC4/4800_F144/RTE_Device.h
//   <o> RTE_SPI4_SLAVE_SELECT INPUT Pin <0=>P5_3
#if    (RTE_SPI4_SLAVE_SELECT_INPUT_ID == 0)
#define RTE_SPI4_SLAVE_SELECT_INPUT_PORT              P5_3
#define RTE_SPI4_SLAVE_SELECT_INPUT                   USIC2_C0_DX2_P5_3
#else
#error "Invalid SPI4 SLAVE SELECT INPUT Pin Configuration!"
#endif

//   <o> SPI4_RX FIFO ENTRIES <0=>0 <1=>2 <2=>4 <3=>8 <4=>16 <5=>32
#if    (RTE_SPI4_RX_FIFO_SIZE_ID == 0)
#define RTE_SPI4_RX_FIFO_SIZE         NO_FIFO
#define RTE_SPI4_RX_FIFO_SIZE_NUM     0
#elif  (RTE_SPI4_RX_FIFO_SIZE_ID == 1)
#define RTE_SPI4_RX_FIFO_SIZE         FIFO_SIZE_2
#define RTE_SPI4_RX_FIFO_SIZE_NUM     2
#elif  (RTE_SPI4_RX_FIFO_SIZE_ID == 2)
#define RTE_SPI4_RX_FIFO_SIZE         FIFO_SIZE_4
#define RTE_SPI4_RX_FIFO_SIZE_NUM     4
#elif  (RTE_SPI4_RX_FIFO_SIZE_ID == 3)
#define RTE_SPI4_RX_FIFO_SIZE         FIFO_SIZE_8
#define RTE_SPI4_RX_FIFO_SIZE_NUM     8
#elif  (RTE_SPI4_RX_FIFO_SIZE_ID == 4)
#define RTE_SPI4_RX_FIFO_SIZE         FIFO_SIZE_16
#define RTE_SPI4_RX_FIFO_SIZE_NUM     16
#elif  (RTE_SPI4_RX_FIFO_SIZE_ID == 5)
#define RTE_SPI4_RX_FIFO_SIZE         FIFO_SIZE_32
#define RTE_SPI4_RX_FIFO_SIZE_NUM     32
#else
#error "Invalid SPI4_RX FIFO SIZE Configuration!"
#endif

//   <o> SPI4_TX FIFO ENTRIES <0=>0 <1=>2 <2=>4 <3=>8 <4=>16 <5=>32
#if    (RTE_SPI4_TX_FIFO_SIZE_ID == 0)
#define RTE_SPI4_TX_FIFO_SIZE         NO_FIFO
#define RTE_SPI4_TX_FIFO_SIZE_NUM     0
#elif  (RTE_SPI4_TX_FIFO_SIZE_ID == 1)
#define RTE_SPI4_TX_FIFO_SIZE         FIFO_SIZE_2
#define RTE_SPI4_TX_FIFO_SIZE_NUM     2
#elif  (RTE_SPI4_TX_FIFO_SIZE_ID == 2)
#define RTE_SPI4_TX_FIFO_SIZE         FIFO_SIZE_4
#define RTE_SPI4_TX_FIFO_SIZE_NUM     4
#elif  (RTE_SPI4_TX_FIFO_SIZE_ID == 3)
#define RTE_SPI4_TX_FIFO_SIZE         FIFO_SIZE_8
#define RTE_SPI4_TX_FIFO_SIZE_NUM     8
#elif  (RTE_SPI4_TX_FIFO_SIZE_ID == 4)
#define RTE_SPI4_TX_FIFO_SIZE         FIFO_SIZE_16
#define RTE_SPI4_TX_FIFO_SIZE_NUM     16
#elif  (RTE_SPI4_TX_FIFO_SIZE_ID == 5)
#define RTE_SPI4_TX_FIFO_SIZE         FIFO_SIZE_32
#define RTE_SPI4_TX_FIFO_SIZE_NUM     32
#else
#error "Invalid SPI4_TX FIFO SIZE Configuration!"
#endif

//</e>

// <e> SPI5 (Serial peripheral interface) [Driver_SPI5]
// <i> Configuration settings for Driver_SPI5 in component ::Drivers:SPI
//   <o> SPI5 TX MOSI(master) MISO(slave)Pin <0=>P3_5 <1=>P3_11 <2=>P4_7
#if    (RTE_SPI5_TX_ID == 0)
#define RTE_SPI5_TX_PORT              P3_5
#define RTE_SPI5_TX_AF                P3_5_AF_U2C1_DOUT0
#elif  (RTE_SPI5_TX_ID == 1)
#define RTE_SPI5_TX_PORT              P3_11
#define RTE_SPI5_TX_AF                P3_11_AF_U2C1_DOUT0
#elif  (RTE_SPI5_TX_ID == 2)
#define RTE_SPI5_TX_PORT              P4_7
#define RTE_SPI5_TX_AF                P4_7_AF_U2C1_DOUT0
#else
#error "Invalid SPI5_TX Pin Configuration!"
#endif

//   <o> SPI5 RX MISO(master) MOSI(slave) <0=>P3_4 <1=>P3_5 <2=>P3_12 <3=>P4_0 <4=>P4_6
#if    (RTE_SPI5_RX_ID == 0)
#define RTE_SPI5_RX_PORT              P3_4
#define RTE_SPI5_RX_INPUT             USIC2_C1_DX0_P3_4
#elif  (RTE_SPI5_RX_ID == 1)
#define RTE_SPI5_RX_PORT              P3_5
#define RTE_SPI5_RX_INPUT             USIC2_C1_DX0_P3_5
#elif  (RTE_SPI5_RX_ID == 3)
#define RTE_SPI5_RX_PORT              P3_12
#define RTE_SPI5_RX_INPUT             USIC2_C1_DX0_P3_12
#elif  (RTE_SPI5_RX_ID == 3)
#define RTE_SPI5_RX_PORT              P4_0
#define RTE_SPI5_RX_INPUT             USIC2_C1_DX0_P4_0
#elif  (RTE_SPI5_RX_ID == 4)
#define RTE_SPI5_RX_PORT              P4_6
#define RTE_SPI5_RX_INPUT             USIC2_C1_DX0_P4_6
#else
#error "Invalid SPI5_RX Pin Configuration!"
#endif

//   <o> SPI5_CLK OUTPUT Pin <0=>P3_6 <1=>P3_13 <2=>P4_2
#if    (RTE_SPI5_CLK_OUTPUT_ID == 0)
#define RTE_SPI5_CLK_OUTPUT_PORT              P3_6
#define RTE_SPI5_CLK_AF                       P3_6_AF_U2C1_SCLKOUT
#elif  (RTE_SPI5_CLK_OUTPUT_ID == 1)
#define RTE_SPI5_CLK_OUTPUT_PORT              P3_13
#define RTE_SPI5_CLK_AF                       P3_13_AF_U2C1_SCLKOUT
#elif  (RTE_SPI5_CLK_OUTPUT_ID == 2)
#define RTE_SPI5_CLK_OUTPUT_PORT              P4_2
#define RTE_SPI5_CLK_AF                       P4_2_AF_U2C1_SCLKOUT
#else
#error "Invalid SPI5 CLOCK OUTPUT Pin Configuration!"
#endif

//   <h> SPI5_SLAVE SELECT Pins 
// <e> SLAVE SELECT LINE 0
// <i> Enable slave select line 0
//   <o> SPI5_SLAVE SELECT LINE 0 Pin <0=>P3_0 <1=>P4_1
#if    (RTE_SPI5_SLAVE_SELECT_LINE_0_ID == 0)
#define RTE_SPI5_SLAVE_SELECT_LINE_0_PORT              P3_0
#define RTE_SPI5_SLAVE_SELECT_LINE_0_AF                P3_0_AF_U2C1_SELO0
#elif  (RTE_SPI5_SLAVE_SELECT_LINE_0_ID == 1)
#define RTE_SPI5_SLAVE_SELECT_LINE_0_PORT              P4_1
#define RTE_SPI5_SLAVE_SELECT_LINE_0_AF                P4_1_AF_U2C1_SELO0
#else
#error "Invalid SPI5 SLAVE SELECT LINE 0 Pin Configuration!"
#endif
// </e>

// <e> SLAVE SELECT LINE 1
// <i> Enable slave select line 1
//   <o> SPI5_SLAVE SELECT LINE 1 Pin <0=>P4_2
#if    (RTE_SPI5_SLAVE_SELECT_LINE_1_ID == 0)
#define RTE_SPI5_SLAVE_SELECT_LINE_1_PORT              P4_2
#define RTE_SPI5_SLAVE_SELECT_LINE_1_AF                P4_2_AF_U2C1_SELO1
#else
#error "Invalid SPI5 SLAVE SELECT LINE 1 Pin Configuration!"
#endif
// </e>

// <e> SLAVE SELECT LINE 2
// <i> Enable slave select line 2
//   <o> SPI5_SLAVE SELECT LINE 2 Pin <0=>P4_3
#if    (RTE_SPI5_SLAVE_SELECT_LINE_2_ID == 0)
#define RTE_SPI5_SLAVE_SELECT_LINE_2_PORT              P4_3
#define RTE_SPI5_SLAVE_SELECT_LINE_2_AF                P4_3_AF_U2C1_SELO2
#else
#error "Invalid SPI5 SLAVE SELECT LINE 2 Pin Configuration!"
#endif
//</e>
// </h>

//   <o> SPI5_CLK INPUT Pin <0=>P3_6 <1=>P4_2
#if    (RTE_SPI5_CLK_INPUT_ID == 0)
#define RTE_SPI5_CLK_INPUT_PORT              P3_6
#define RTE_SPI5_CLK_INPUT                   USIC2_C1_DX1_P3_6
#elif  (RTE_SPI5_CLK_INPUT_ID == 1)
#define RTE_SPI5_CLK_INPUT_PORT              P4_2
#define RTE_SPI5_CLK_INPUT                   USIC2_C1_DX1_P4_2
#else
#error "Invalid SPI5 CLOCK INPUT Pin Configuration!"
#endif

