mthielvoldt/firment/firmware/port/XMC4/4800_F144/RTE_Device.h
//   <o> I2S1_WS OUTPUT Pin <0=>P2_3 <1=>P3_1 <2=>P4_1 <3=>P6_1
#define RTE_I2S1_WS_OUTPUT_ID                0
#if     (RTE_I2S1_WS_OUTPUT_ID == 0)
#define RTE_I2S1_WS_OUTPUT_PORT              P2_3
#define RTE_I2S1_WS_AF                       P2_3_AF_U0C1_SELO0
#elif   (RTE_I2S1_WS_OUTPUT_ID == 1)
#define RTE_I2S1_WS_OUTPUT_PORT              P3_1
#define RTE_I2S1_WS_AF                       P3_1_AF_U0C1_SELO0
#elif   (RTE_I2S1_WS_OUTPUT_ID == 2)
#define RTE_I2S1_WS_OUTPUT_PORT              P4_1
#define RTE_I2S1_WS_AF                       P4_1_AF_U0C1_SELO0
#elif   (RTE_I2S1_WS_OUTPUT_ID == 3)
#define RTE_I2S1_WS_OUTPUT_PORT              P6_1
#define RTE_I2S1_WS_AF                       P6_1_AF_U0C1_SELO0
#else
#error "Invalid I2S1_WS Output Pin Configuration!"
#endif

//   <o> I2S1_WS INPUT Pin <0=>P2_3 <1=>P3_1 <2=>P6_1
#define RTE_I2S1_WS_INPUT_ID                 0
#if    (RTE_I2S1_WS_INPUT_ID == 0)
#define RTE_I2S1_WS_INPUT_PORT               P2_3
#define RTE_I2S1_WS_INPUT_ID_INPUT           USIC0_C1_DX2_P2_3
#elif  (RTE_I2S1_WS_INPUT_ID == 1)
#define RTE_I2S1_WS_INPUT_PORT               P3_1
#define RTE_I2S1_WS_INPUT_ID_INPUT           USIC0_C1_DX2_P3_1
#elif  (RTE_I2S1_WS_INPUT_ID == 2)
#define RTE_I2S1_WS_INPUT_PORT               P6_1
#define RTE_I2S1_WS_INPUT_ID_INPUT           USIC0_C1_DX2_P6_1
#else
#error "Invalid I2S1_WS Input Pin Configuration!"
#endif

// <e> Enable MCLK output
#define RTE_I2S1_MCLK_OUTPUT_ENABLE          0
//   <o> I2S1_MCLK OUTPUT Pin <0=>P6_5
#define RTE_I2S1_MCLK_OUTPUT_ID              0
#if    (RTE_I2S1_MCLK_OUTPUT_ID == 0)
#define RTE_I2S1_MCLK_OUTPUT_PORT            P6_5
#define RTE_I2S1_MCLK_AF                     P6_5_AF_U0C1_MCLKOUT
#else
#error "Invalid I2S1_MCLK Output Pin Configuration!"
#endif
// </e>

//   <o> I2S1_RX FIFO ENTRIES <0=>0 <1=>2 <2=>4 <3=>8 <4=>16 <5=>32
#define RTE_I2S1_RX_FIFO_SIZE_ID                4
#if    (RTE_I2S1_RX_FIFO_SIZE_ID == 0)
#define RTE_I2S1_RX_FIFO_SIZE         NO_FIFO
#define RTE_I2S1_RX_FIFO_SIZE_NUM     0
#elif  (RTE_I2S1_RX_FIFO_SIZE_ID == 1)
#define RTE_I2S1_RX_FIFO_SIZE         FIFO_SIZE_2
#define RTE_I2S1_RX_FIFO_SIZE_NUM     2
#elif  (RTE_I2S1_RX_FIFO_SIZE_ID == 2)
#define RTE_I2S1_RX_FIFO_SIZE         FIFO_SIZE_4
#define RTE_I2S1_RX_FIFO_SIZE_NUM     4
#elif  (RTE_I2S1_RX_FIFO_SIZE_ID == 3)
#define RTE_I2S1_RX_FIFO_SIZE         FIFO_SIZE_8
#define RTE_I2S1_RX_FIFO_SIZE_NUM     8
#elif  (RTE_I2S1_RX_FIFO_SIZE_ID == 4)
#define RTE_I2S1_RX_FIFO_SIZE         FIFO_SIZE_16
#define RTE_I2S1_RX_FIFO_SIZE_NUM     16
#elif  (RTE_I2S1_RX_FIFO_SIZE_ID == 5)
#define RTE_I2S1_RX_FIFO_SIZE         FIFO_SIZE_32
#define RTE_I2S1_RX_FIFO_SIZE_NUM     32
#else
#error "Invalid I2S1_RX FIFO SIZE Configuration!"
#endif

//   <o> I2S1_TX FIFO ENTRIES <0=>0 <1=>2 <2=>4 <3=>8 <4=>16 <5=>32
#define RTE_I2S1_TX_FIFO_SIZE_ID                4
#if    (RTE_I2S1_TX_FIFO_SIZE_ID == 0)
#define RTE_I2S1_TX_FIFO_SIZE         NO_FIFO
#define RTE_I2S1_TX_FIFO_SIZE_NUM     0
#elif  (RTE_I2S1_TX_FIFO_SIZE_ID == 1)
#define RTE_I2S1_TX_FIFO_SIZE         FIFO_SIZE_2
#define RTE_I2S1_TX_FIFO_SIZE_NUM     2
#elif  (RTE_I2S1_TX_FIFO_SIZE_ID == 2)
#define RTE_I2S1_TX_FIFO_SIZE         FIFO_SIZE_4
#define RTE_I2S1_TX_FIFO_SIZE_NUM     4
#elif  (RTE_I2S1_TX_FIFO_SIZE_ID == 3)
#define RTE_I2S1_TX_FIFO_SIZE         FIFO_SIZE_8
#define RTE_I2S1_TX_FIFO_SIZE_NUM     8
#elif  (RTE_I2S1_TX_FIFO_SIZE_ID == 4)
#define RTE_I2S1_TX_FIFO_SIZE         FIFO_SIZE_16
#define RTE_I2S1_TX_FIFO_SIZE_NUM     16
#elif  (RTE_I2S1_TX_FIFO_SIZE_ID == 5)
#define RTE_I2S1_TX_FIFO_SIZE         FIFO_SIZE_32
#define RTE_I2S1_TX_FIFO_SIZE_NUM     32
#else
#error "Invalid I2S1_TX FIFO SIZE Configuration!"
#endif
//</e>

// <e> I2S2 (Inter-Integrated Sound) [Driver_SAI2]
// <i> Configuration settings for Driver_SAI2 in component ::Drivers:SAI
#define RTE_I2S2                      0

//   <o> I2S2_TX Pin <0=>P0_5 <1=>P1_15 <2=>P2_14
#define RTE_I2S2_TX_ID                0
#if    (RTE_I2S2_TX_ID == 0)
#define RTE_I2S2_TX_PORT              P0_5
#define RTE_I2S2_TX_AF                P0_5_AF_U1C0_DOUT0
#elif  (RTE_I2S2_TX_ID == 1)
#define RTE_I2S2_TX_PORT              P1_15
#define RTE_I2S2_TX_AF                P1_15_AF_U1C0_DOUT0
#elif  (RTE_I2S2_TX_ID == 2)
#define RTE_I2S2_TX_PORT              P2_14
#define RTE_I2S2_TX_AF                P2_14_AF_U1C0_DOUT0
#else
#error "Invalid I2S2_TX Pin Configuration!"
#endif

//   <o> I2S2_RX Pin <0=>P0_4 <1=>P0_5 <2=>P1_14 <3=>P2_14 <4=>P2_15
#define RTE_I2S2_RX_ID                0
#if    (RTE_I2S2_RX_ID == 0)
#define RTE_I2S2_RX_PORT              P0_4
#define RTE_I2S2_RX_INPUT             USIC1_C0_DX0_P0_4
#elif  (RTE_I2S2_RX_ID == 1)
#define RTE_I2S2_RX_PORT              P0_5
#define RTE_I2S2_RX_INPUT             USIC1_C0_DX0_P0_5
#elif  (RTE_I2S2_RX_ID == 2)
#define RTE_I2S2_RX_PORT              P1_14
#define RTE_I2S2_RX_INPUT             USIC1_C0_DX0_P1_14
#elif  (RTE_I2S2_RX_ID == 3)
#define RTE_I2S2_RX_PORT              P2_14
#define RTE_I2S2_RX_INPUT             USIC1_C0_DX0_P2_14
#elif  (RTE_I2S2_RX_ID == 4)
#define RTE_I2S2_RX_PORT              P2_15
#define RTE_I2S2_RX_INPUT             USIC1_C0_DX0_P2_15
#else
#error "Invalid I2S2_RX Pin Configuration!"
#endif

//   <o> I2S2_CLK OUTPUT Pin <0=>P0_11 <1=>P4_0 <2=>P5_8
#define RTE_I2S2_CLK_OUTPUT_ID                0
#if    (RTE_I2S2_CLK_OUTPUT_ID == 0)
#define RTE_I2S2_CLK_OUTPUT_PORT              P0_11
#define RTE_I2S2_CLK_AF                       P0_11_AF_U1C0_SCLKOUT
#elif  (RTE_I2S2_CLK_OUTPUT_ID == 1)
#define RTE_I2S2_CLK_OUTPUT_PORT              P4_0
#define RTE_I2S2_CLK_AF                       P4_0_AF_U1C0_SCLKOUT
#elif  (RTE_I2S2_CLK_OUTPUT_ID == 2)
#define RTE_I2S2_CLK_OUTPUT_PORT              P5_8
#define RTE_I2S2_CLK_AF                       P5_8_AF_U1C0_SCLKOUT
#else
#error "Invalid I2S2 CLOCK OUTPUT Pin Configuration!"
#endif

//   <o> I2S2_CLK INPUT Pin <0=>P0_11 <1=>P5_8
#define RTE_I2S2_CLK_INPUT_ID                0
#if    (RTE_I2S2_CLK_INPUT_ID == 0)
#define RTE_I2S2_CLK_INPUT_PORT              P0_11
#define RTE_I2S2_CLK_INPUT                   USIC1_C0_DX1_P0_11
#elif  (RTE_I2S2_CLK_INPUT_ID == 1)
#define RTE_I2S2_CLK_INPUT_PORT              P5_8
#define RTE_I2S2_CLK_INPUT                   USIC1_C0_DX1_P5_8
#else
#error "Invalid I2S2 CLOCK INPUT Pin Configuration!"
#endif

